In [1]:
import csv
import os
import pandas as pd
# print(os.getcwd())

df = pd.read_csv("salary_dataset.csv")
df.head() # gets first 5 rows

,Employee_ID,Name,Age,Gender,Country,City,Education,Job_Title,Department,Experience_Years,Salary_USD,Bonus_USD,Work_Hours_Per_Week,Remote_Work,Performance_Score,Joining_Year,Contract_Type
0,1,Employee_1,58,Female,India,NY,Bachelor,Manager,IT,0,130735,3650,41,Yes,1,2015,Part-Time
1,2,Employee_2,48,Female,UK,NY,High School,Designer,HR,4,54363,14600,52,No,2,2022,Part-Time
2,3,Employee_3,34,Male,USA,London,High School,Manager,IT,1,76694,15317,51,Yes,8,2010,Part-Time
3,4,Employee_4,27,Male,UK,Karachi,Bachelor,Developer,Marketing,19,31582,19768,51,Yes,5,2004,Contract
4,5,Employee_5,40,Male,Canada,London,Master,Manager,IT,2,109910,18193,59,Yes,7,2008,Full-Time

Pandas couldn't read my csv file, so i had to get the current working directory(cwd) to make sure i am in the right path. Though it didn't work, so i just closed vs code and opened it again which now worked.

In [ ]:
# save/automatically to/create a new csv file without index
df.to_csv("new_salary_dataset.csv", index=False)

In [ ]:
# import sys
# sys.executable # to check current python interpreter
%pip install openpyxl # % symbol indicates to install on current python environment/interpreter

In [5]:
# read excel file
df = pd.read_excel("salary_dataset.xlsx")
df.head()

,Employee_ID,Name,Age,Gender,Country,City,Education,Job_Title,Department,Experience_Years,Salary_USD,Bonus_USD,Work_Hours_Per_Week,Remote_Work,Performance_Score,Joining_Year,Contract_Type
0,1,Employee_1,58,Female,India,NY,Bachelor,Manager,IT,0,130735,3650,41,Yes,1,2015,Part-Time
1,2,Employee_2,48,Female,UK,NY,High School,Designer,HR,4,54363,14600,52,No,2,2022,Part-Time
2,3,Employee_3,34,Male,USA,London,High School,Manager,IT,1,76694,15317,51,Yes,8,2010,Part-Time
3,4,Employee_4,27,Male,UK,Karachi,Bachelor,Developer,Marketing,19,31582,19768,51,Yes,5,2004,Contract
4,5,Employee_5,40,Male,Canada,London,Master,Manager,IT,2,109910,18193,59,Yes,7,2008,Full-Time

alright i had issues trying to read an excel file but what i did was to install openpyxl for readig excel files. i had also had i issues trying to pip install with ! (cmd symbol) bc it was installing in a different python interpreter so i had to use % (symbol for installing in current interpreter) which now worked

In [ ]:
# to read csv with selected columns
pd.read_csv("salary_dataset.csv", usecols=["Age", "Salary_USD"])

# read csv and handle missing values
pd.read_csv("salary_dataset.csv", na_values=["?", "NA", "missing"])

# read only first 5 rows
pd.read_csv("salary_dataset.csv", nrows=5)

# read excel specific sheet
pd.read_excel("salary_dataset.xlsx", sheet_name="test_dataset")

name     0
age      0
score    3
dtype: int64

In [ ]:
# Challenge

# load csv
df = pd.read_csv("students.csv")
print(display(df))

# print first 3 rows
# pd.read_csv("students.csv", nrows=3)
df.head(3) # smarter way

# check number of missing values
df.isna().sum()

# select only age and score
pd.read_csv("students.csv", usecols=["age", "score"])

# # remove rows where score is missing
# df = df.dropna()

# # save cleaned data as new csv file
# df.to_csv("students_clean.csv", index=False)

# fill missing values with the mean of entire score column
df.fillna("missing")
df["score"] = df["score"].fillna(df["score"].mean())
df.round(1)

      name  age  score
0    Alice   22   85.0
1      Bob   20    NaN
2  Charlie   21   92.0
3    Diana   23   78.0
4      Eve   19   95.0
5    Frank   24    NaN
6    Grace   22   88.0
7    Henry   20   76.0
8      Ivy   21   91.0
9     Jack   23    NaN

None

      name  age  score
0    Alice   22   85.0
1      Bob   20   86.4
2  Charlie   21   92.0
3    Diana   23   78.0
4      Eve   19   95.0
5    Frank   24   86.4
6    Grace   22   88.0
7    Henry   20   76.0
8      Ivy   21   91.0
9     Jack   23   86.4

the full meaning of csv is comma-separated values

In [ ]:
# homework
# load csv file
df = pd.read_csv("weather.csv")
print(df)

# add a new column
df["temp_f"] = df["temp"] * 1.8 + 32
df

# save clean data
df.to_csv("weather_clean.csv", index=False)

# reload the saved file
df_reload = pd.read_csv("weather_clean.csv")

print("Reloaded from wather_clean.csv:")
df_reload

            city  temp
0          Lagos    30
1          Abuja    28
2  Port Harcourt    31
3           Kano    25
4         Ibadan    29
5          Enugu    27
Reloaded from wather_clean.csv:

            city  temp  temp_f
0          Lagos    30    86.0
1          Abuja    28    82.4
2  Port Harcourt    31    87.8
3           Kano    25    77.0
4         Ibadan    29    84.2
5          Enugu    27    80.6

In [85]:
# statistics for ML
df = pd.read_csv("salary_dataset.csv")
df = df.head()
print(display(df))

# get summary
df.describe()

# get mean
df[["Age", "Experience_Years", "Bonus_USD", "Work_Hours_Per_Week", "Performance_Score"]].mean() # too long
df.select_dtypes(include="number").drop(columns=["Employee_ID", "Joining_Year"]).mean() # smarter way

# get median
df.select_dtypes(include="number").drop(columns=["Employee_ID", "Joining_Year"]).median()

# get standard deviation
df.select_dtypes(include="number").drop(columns=["Employee_ID", "Joining_Year"]).std()

# get corr
df_corr = df.select_dtypes(include="number").drop(columns=["Employee_ID", "Joining_Year"]).corr()
df_corr["Performance_Score"]

group_cols = df.select_dtypes(include="object").columns.to_list()
df.groupby(group_cols).mean(numeric_only=True).reset_index()

,Employee_ID,Name,Age,Gender,Country,City,Education,Job_Title,Department,Experience_Years,Salary_USD,Bonus_USD,Work_Hours_Per_Week,Remote_Work,Performance_Score,Joining_Year,Contract_Type
0,1,Employee_1,58,Female,India,NY,Bachelor,Manager,IT,0,130735,3650,41,Yes,1,2015,Part-Time
1,2,Employee_2,48,Female,UK,NY,High School,Designer,HR,4,54363,14600,52,No,2,2022,Part-Time
2,3,Employee_3,34,Male,USA,London,High School,Manager,IT,1,76694,15317,51,Yes,8,2010,Part-Time
3,4,Employee_4,27,Male,UK,Karachi,Bachelor,Developer,Marketing,19,31582,19768,51,Yes,5,2004,Contract
4,5,Employee_5,40,Male,Canada,London,Master,Manager,IT,2,109910,18193,59,Yes,7,2008,Full-Time

None

,Name,Gender,Country,City,Education,Job_Title,Department,Remote_Work,Contract_Type,Employee_ID,Age,Experience_Years,Salary_USD,Bonus_USD,Work_Hours_Per_Week,Performance_Score,Joining_Year
0,Employee_1,Female,India,NY,Bachelor,Manager,IT,Yes,Part-Time,1.0,58.0,0.0,130735.0,3650.0,41.0,1.0,2015.0
1,Employee_2,Female,UK,NY,High School,Designer,HR,No,Part-Time,2.0,48.0,4.0,54363.0,14600.0,52.0,2.0,2022.0
2,Employee_3,Male,USA,London,High School,Manager,IT,Yes,Part-Time,3.0,34.0,1.0,76694.0,15317.0,51.0,8.0,2010.0
3,Employee_4,Male,UK,Karachi,Bachelor,Developer,Marketing,Yes,Contract,4.0,27.0,19.0,31582.0,19768.0,51.0,5.0,2004.0
4,Employee_5,Male,Canada,London,Master,Manager,IT,Yes,Full-Time,5.0,40.0,2.0,109910.0,18193.0,59.0,7.0,2008.0

Alright for the correlation part, i figured out that the higher the age -> the higher the salary but doesn't apply to bonus, therefore the work hours per week, performance score and experience years -> the higher the bonus. 

for the grouping part, tried to pass all the columns at once without manually inputing it so i had to convert the group_cols into a list for it successfully get me the mean.

In [58]:
# more challenges
df = pd.read_csv("student_scores.csv")
print(df)

# get summary
df.describe()

# get mean score
df.mean() # now smarter
# or
df.select_dtypes(include="number").drop(columns=["hours_studied"]).mean() # less smarter

# get median score
df.median()

# get standard deviation
df.std()

# find corr
df.corr()

    hours_studied  score
0               1     69
1               2     51
2               3     52
3               4     60
4               5     87
5               6     89
6               7     81
7               8    100
8               9    100
9              10    100
10             11    110
11             12    100
12             13    100
13             14    100
14             15    100

               hours_studied     score
hours_studied       1.000000  0.836265
score               0.836265  1.000000

In [93]:
# Encoding categorical data (get_dummies, factorize)
df = pd.read_csv("salary_dataset.csv")
df = df.head()
print(display(df))

# one-Hot Encoding(get_dummies)
Gender_n = pd.get_dummies(df["Gender"], dtype=int)

# Label Encoding (Factorize)
codes, uniques = pd.factorize(df["Gender"])
print(codes)
print(uniques)

# add one-hot encoding to df
df = df.join(Gender_n)
df

# replace label encoding to df
df["Gender"] = codes
df

,Employee_ID,Name,Age,Gender,Country,City,Education,Job_Title,Department,Experience_Years,Salary_USD,Bonus_USD,Work_Hours_Per_Week,Remote_Work,Performance_Score,Joining_Year,Contract_Type
0,1,Employee_1,58,Female,India,NY,Bachelor,Manager,IT,0,130735,3650,41,Yes,1,2015,Part-Time
1,2,Employee_2,48,Female,UK,NY,High School,Designer,HR,4,54363,14600,52,No,2,2022,Part-Time
2,3,Employee_3,34,Male,USA,London,High School,Manager,IT,1,76694,15317,51,Yes,8,2010,Part-Time
3,4,Employee_4,27,Male,UK,Karachi,Bachelor,Developer,Marketing,19,31582,19768,51,Yes,5,2004,Contract
4,5,Employee_5,40,Male,Canada,London,Master,Manager,IT,2,109910,18193,59,Yes,7,2008,Full-Time

None
[0 0 1 1 1]
Index(['Female', 'Male'], dtype='object')

,Employee_ID,Name,Age,Gender,Country,City,Education,Job_Title,Department,Experience_Years,Salary_USD,Bonus_USD,Work_Hours_Per_Week,Remote_Work,Performance_Score,Joining_Year,Contract_Type,Female,Male
0,1,Employee_1,58,0,India,NY,Bachelor,Manager,IT,0,130735,3650,41,Yes,1,2015,Part-Time,1,0
1,2,Employee_2,48,0,UK,NY,High School,Designer,HR,4,54363,14600,52,No,2,2022,Part-Time,1,0
2,3,Employee_3,34,1,USA,London,High School,Manager,IT,1,76694,15317,51,Yes,8,2010,Part-Time,0,1
3,4,Employee_4,27,1,UK,Karachi,Bachelor,Developer,Marketing,19,31582,19768,51,Yes,5,2004,Contract,0,1
4,5,Employee_5,40,1,Canada,London,Master,Manager,IT,2,109910,18193,59,Yes,7,2008,Full-Time,0,1

figured out one-hot encoding(get_dummies) outputs new columns, so best to use df.join() to add it to the df
and label encoding(factorize) gives one column(codes) which can be replaced/added to the df

In [120]:
# encoding challenge
df = pd.read_csv("customer_data.csv")
print(display(df))

# one-hot encode gender
gender_dummies = pd.get_dummies(df["gender"], dtype=int)
df = df.join(gender_dummies)

# one-hot encode payment
payment_dummies = pd.get_dummies(df["payment"], dtype=int)

# combine all encoded columns into df
pd.concat([gender_dummies, payment_dummies], axis=1)

# factorize payment
codes, uniques = pd.factorize(df["payment"])
codes
uniques

# add codes for gender using factorize
codes, uniques = pd.factorize(df["gender"])
df["gender_n"] = codes # to add
df

   gender   payment
0    male      cash
1  female      card
2  female  transfer
3    male      card
4    male      cash
5  female  transfer
6    male  transfer
7  female      cash

None

   gender   payment  female  male  gender_n
0    male      cash       0     1         0
1  female      card       1     0         1
2  female  transfer       1     0         1
3    male      card       0     1         0
4    male      cash       0     1         0
5  female  transfer       1     0         1
6    male  transfer       0     1         0
7  female      cash       1     0         1

i was curious about how head() from df.head() is not coming directly from pandas library rather it comes directly from DataFrame which is a class that comes directly from pd. In context, pd is a library that contains df which is a class therefore, head() is a method(action) of df and we also have attribute(data) of df like df.columns. If you know oops, you'll get the logic of what i'm saying.

read_csv from pd.read_csv is a standalone function inside pandas.

In [95]:
# 100 days of python practice

# with open("weather_data.csv") as f:
#     data = f.readlines()
    # print(data)

# with open("weather_data.csv") as data_file:
#     data = csv.reader(data_file)
#     temperatures = []
#     for row in data:
#         if row[1] != "temp":
#             temperatures.append(int(row[1]))
#     print(temperatures)

df = pd.read_csv("weather_data.csv")
df

# type(df["temp"])
df.to_dict()
len(df["temp"].to_list())

# challenge - get average of temp
df["temp"].mean()

# get the max value
df["temp"].max()

# get data in columns
df["condition"]
df.condition # pd already taking the columns as attributes/actions
df.temp

# get data in a row
df[df.day == "Monday"]
# df.loc[0]

# get row with max temp
df[df.temp == df.temp.max()]

# tamp into the max row
max = df[df.temp == df.temp.max()]
max.condition
max["temp"]
max.day

# challenge - convert mondays temp to farenheit
# method 1
monday = df[df.day == "Monday"]
monday_temp = monday.temp[0] # get the temp value
monday_temp = (monday.temp * 9/5) + 32
monday_temp

# method 2
monday_temp = df.loc[0, "temp"] # get the temp value
monday_temp = (monday_temp * 9/5) + 32

# replace value to df
df["temp"] = df["temp"].replace(12, monday_temp)
df

# create a df from scratch
data_dict = {
    "students": ["Dave", "July", "June"],
    "scores": [90, 80, 94]
}

df = pd.DataFrame(data_dict)
df

  students  scores
0     Dave      90
1     July      80
2     June      94

In [188]:
# squirrel census analysis with pandas
df = pd.read_csv("2018_Central_Park_Squirrel_Census_-_Squirrel_Data.csv")
gray_squirrels_count = len(df[df["Primary Fur Color"] == "Gray"])
cinnamon_squirrels_count = len(df[df["Primary Fur Color"] == "Cinnamon"])
black_squirrels_count = len(df[df["Primary Fur Color"] == "Black"])

data_dict = pd.DataFrame({
    "fur_color": ["Gray", "Red", "Black"],
    "count": [gray_squirrels_count, cinnamon_squirrels_count, black_squirrels_count]
})

data_dict.to_csv("clean_squirrel_color_count.csv")

In [9]:
#  still on 100 days of python
df = pd.read_csv("salaries_by_college_major.csv")
df.head()
df.shape
df.columns
df.isna()
df.tail()
clean_df = df.dropna()
# print(display(clean_df.tail()))

# find major with highest starting salary
clean_df[clean_df["Starting Median Salary"] == df["Starting Median Salary"].max()]
# or get the index of row with the largest value and use loc to get the corresponding name
clean_df["Starting Median Salary"].idxmax()
clean_df["Undergraduate Major"].loc[43]
# or double square brackets
clean_df["Undergraduate Major"][43]
# or using .loc to retrieve an entire row
clean_df.loc[43]

# challenge

# get the college major with the highest mid career salary
clean_df["Mid-Career Median Salary"].idxmax() # returns the index of max value of each column
clean_df["Undergraduate Major"][8]
# get the salary eearned
clean_df["Mid-Career Median Salary"][8]

# get the college with lowest starting salary
clean_df["Undergraduate Major"].loc[clean_df['Starting Median Salary'].idxmin()]
# get how much they earn after university
clean_df["Starting Median Salary"][clean_df['Starting Median Salary'].idxmin()]

# get college major with lowest mid-career salary
clean_df["Undergraduate Major"][clean_df["Mid-Career Median Salary"].idxmin()]
# get how much people expect to earn with this degree
clean_df["Mid-Career Median Salary"][clean_df["Mid-Career Median Salary"].idxmin()]

# sorting values and adding columns
# low risk major - get the difference between the earnings of the 10th and 90th percentile
# clean_df["Mid-Career 90th Percentile Salary"] - clean_df["Mid-Career 10th Percentile Salary"]
# or
# clean_df["Mid-Career 90th Percentile Salary"].subtract(clean_df["Mid-Career 10th Percentile Salary"])
spread_col = clean_df["Mid-Career 90th Percentile Salary"].subtract(clean_df["Mid-Career 10th Percentile Salary"])
clean_df.insert(1, "spread", spread_col)
clean_df.head()

# sorting by lowest spread
low_risk = clean_df.sort_values(by="spread", ascending=False)
low_risk[["Undergraduate Major", "spread"]].head()

# get potential values in 90th percentile
potential_majors = clean_df.sort_values(by="Mid-Career 90th Percentile Salary", ascending=False)
potential_majors[["Undergraduate Major", "Mid-Career 90th Percentile Salary"]].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

In [ ]:
#  grouping and pivoting data with pandas
df = pd.read_csv("salaries_by_college_major.csv")
df[df.isna().any(axis=1)] # get only the orw containing NaN
df.isna().sum().sum()
clean_df = df.dropna()
print(display(clean_df.head()))

# count how many majors we have in each category
clean_df.groupby("Group")["Undergraduate Major"].count()

# challenge - get the average salary by group
clean_df.groupby("Group").mean(numeric_only=True).reset_index()

clean_df.select_dtypes("number").groupby(clean_df["Group"]).mean().round(2)

np.int64(5)